README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-07-31 Sun 11:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>GFramework for Unity developer</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dong Guo" />
<link rel="stylesheet" href="http://orgmode.org/org-manual.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">GFramework for Unity developer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline5">2. 设计宗旨</a></li>
<li><a href="#orgheadline12">3. 模块</a>
<ul>
<li><a href="#orgheadline10">3.1. 当前包含模块</a>
<ul>
<li><a href="#orgheadline6">3.1.1. Mgr</a></li>
<li><a href="#orgheadline7">3.1.2. Utility</a></li>
<li><a href="#orgheadline8">3.1.3. UI 控件</a></li>
<li><a href="#orgheadline9">3.1.4. 编辑器</a></li>
</ul>
</li>
<li><a href="#orgheadline11">3.2. 待开发模块</a></li>
</ul>
</li>
<li><a href="#orgheadline19">4. 使用方法</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
GFramework for Unity developer, 简称 GFW<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> 设计宗旨</h2>
<div class="outline-text-2" id="text-2">
<p>
这是一个精练的框架，该框架的设计宗旨是加速 Unity 开发。目前采用了以下的方法来实现设计宗旨：<br  />
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline2"></a>充分利用 Unity 便捷的开发功能。例如，框架不会禁用脚本变量绑定，这样的功能可以有效提高开发效率。<br  /></li>
<li><a id="orgheadline3"></a>有效分解开发参与者工作的耦合。例如，框架规定所有 UI 面板都制作为 Prefabs 放置在 Resource/UI/下。不同 UI 面板可以由不同人制作。<br  /></li>
<li><a id="orgheadline4"></a>框架需要保持简单易用。例如，框架采用扁平结构即大部分模块的功能以单例或者静态类的形式提供。<br  /><div class="outline-text-6" id="text-2-0-0-0-3">
<p>
。。。。（后续想到再补充）<br  />
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">3</span> 模块</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">3.1</span> 当前包含模块</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">3.1.1</span> Mgr</h4>
<div class="outline-text-4" id="text-3-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">模块名称</th>
<th scope="col" class="org-left">介绍</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GMainMgr</td>
<td class="org-left">总的管理者，会负责框架的初始化、全局的消息处理。</td>
</tr>

<tr>
<td class="org-left">GSceneMgr</td>
<td class="org-left">场景管理者，负责 Scene 的管理逻辑</td>
</tr>

<tr>
<td class="org-left">GViewMgr/GUIViewMgr/GModalViewMgr</td>
<td class="org-left">UI 管理者，负责 UI 的管理逻辑</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">3.1.2</span> Utility</h4>
<div class="outline-text-4" id="text-3-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Utility 模块名称</th>
<th scope="col" class="org-left">介绍</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GFileUtility</td>
<td class="org-left">文件操作工具</td>
</tr>

<tr>
<td class="org-left">GLogUtility</td>
<td class="org-left">日志工具，支持日志分级，以及导出到文件</td>
</tr>

<tr>
<td class="org-left">GCoordUtility</td>
<td class="org-left">坐标处理相关的工具</td>
</tr>

<tr>
<td class="org-left">GTimeUtility</td>
<td class="org-left">时间相关工具</td>
</tr>

<tr>
<td class="org-left">GAppUtility</td>
<td class="org-left">Application 工具</td>
</tr>

<tr>
<td class="org-left">GUtility</td>
<td class="org-left">通用工具</td>
</tr>
</tbody>
</table>

<p>
Tips: GUtility 目前很不稳定，其中的方法后面可能会放到新的独立文件中。<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">3.1.3</span> UI 控件</h4>
<div class="outline-text-4" id="text-3-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">UI 控件模块</th>
<th scope="col" class="org-left">介绍</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GMovingImage</td>
<td class="org-left">滚动的图片</td>
</tr>
</tbody>
</table>
<p>
Tips: 本框架 UI 基于 uGUI<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">3.1.4</span> 编辑器</h4>
<div class="outline-text-4" id="text-3-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">编辑器模块</th>
<th scope="col" class="org-left">介绍</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GEditorMovingImage</td>
<td class="org-left">对应于 GMovingImage,用于通过编辑器创建 UI</td>
</tr>

<tr>
<td class="org-left">GEditorUIMenu</td>
<td class="org-left">编辑器菜单功能</td>
</tr>

<tr>
<td class="org-left">GEditorUtility</td>
<td class="org-left">编辑器工具</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.2</span> 待开发模块</h3>
<div class="outline-text-3" id="text-3-2">
<p>
按照目前碰到的需求添加<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">4</span> 使用方法</h2>
<div class="outline-text-2" id="text-4">
</div><ol class="org-ol"><li><a id="orgheadline13"></a>UI 资源<br  /><div class="outline-text-5" id="text-4-0-0-1">
<p>
每个 UI 面板都放置在 Resource/UI 下面，可以在该路径下再分文件夹，也可以按照一定命名规则来区分不同模块的 UI。建议 ui 名称采用拼音，方便英语水平低的同事参与 UI 制作。<br  />
UI 面板中元素的命名按照 DefaultName_xxxx，例如：Button_kaishi,Button_guanbi 等等(这样方便后续程序自动化处理)。<br  />
</p>
</div></li>
<li><a id="orgheadline14"></a>GFW 会自动生成游戏对象到场景中，所有自动生成的对象名称规则为__XXX__。下面的结构就是当前框架所生成的：<br  /><div class="outline-text-5" id="text-4-0-0-2">
<pre class="example">
// Canvas
// - __UIView__
// --  __UIView_1__
// --  __UIView_2__
// --  __UIView_3__
// - __ModalView__
// --  __ModalView_1__
// --  __ModalView_2__
// --  __ModalView_3__
// __MainMgr__
</pre>
</div></li>
<li><a id="orgheadline15"></a>框架的入口为 GMainMgr 中的 Init_<br  /><div class="outline-text-5" id="text-4-0-0-3">
<p>
该静态函数添加了[RuntimeInitializeOnLoadMethod],所以场景加载后会执行该方法。需要注意的是，如果你自己的其他类需要在开始的时候进行初始化，那么需要将你的初始化放置在 Init_中，不要在使用[RuntimeInitializeOnLoadMethod]来触发你的初始化方法。因为不同文件中的被标记为 RuntimeInitializeOnLoadMethod 的方法触发顺序是确定的。<br  />
</p>
</div></li>
<li><a id="orgheadline16"></a>新添加场景需要为其添加对应枚举，并注册。<br  /><div class="outline-text-5" id="text-4-0-0-4">
<p>
枚举的添加在 GMainMgr 中的 GESceneType 中。<br  />
Tips:<br  />
这个机制后面会优化掉，场景很多时枚举定义也不太方便，需要支持通过加载配置文件来注册。这个过程最好自动化掉。<br  />
</p>
</div></li>
<li><a id="orgheadline17"></a>场景的切换<br  /><div class="outline-text-5" id="text-4-0-0-5">
<div class="org-src-container">

<pre class="src src-c#">GSceneMgr.GetInstance ().ChangeToScene(sceneType);
GSceneMgr.GetInstance ().ChangeToNextScene ();
</pre>
</div>
</div></li>
<li><a id="orgheadline18"></a>UI 的切换<br  /><div class="outline-text-5" id="text-4-0-0-6">
<p>
UI 管理采用分层栈式结构，GViewZOrder 定义了 UI 的层，Push、Pop 是对 UI 栈的操作。框架默认提供了 3 个层次，如有需要只需按顺序添加新的枚举即可，框架支持层次扩展。<br  />
</p>
<div class="org-src-container">

<pre class="src src-c#">GUIViewMgr.GetInstance ().PushView (CreateBg);
GUIViewMgr.GetInstance ().PushView (GGameStartView.CreateView, GViewZOrder.kZOrder2);
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dong Guo</p>
<p class="date">Created: 2016-07-31 Sun 11:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
